### Plan for production
🟢 Add module.event_sourcing.aws_glue_schema.event_glue_schema["AbTestChangeEvent"]
🟢 Add module.event_sourcing.aws_glue_schema.event_glue_schema["AbTestParticipantAllocationEvent"]
🟠 Replace module.event_sourcing.null_resource.update_checkpoint["AbTestChangeEvent"]
🟠 Replace module.event_sourcing.null_resource.update_checkpoint["AbTestParticipantAllocationEvent"]
🟠 Replace module.ab_testing.module.java_ecs_service.aws_ecs_task_definition.service_task_definition

**2 to add, 0 to modify, 3 to replace, 0 to delete**

<details><summary>Show detailed plan</summary>

```terraform
Terraform will perform the following actions:

  # module.event_sourcing.aws_glue_schema.event_glue_schema["AbTestChangeEvent"] will be created
  + resource "aws_glue_schema" "event_glue_schema" {
      + arn                   = (known after apply)
      + compatibility         = "BACKWARD"
      + data_format           = "JSON"
      + id                    = (known after apply)
      + latest_schema_version = (known after apply)
      + next_schema_version   = (known after apply)
      + registry_arn          = "arn:aws:glue:eu-west-1:090999133015:registry/automotive"
      + registry_name         = (known after apply)
      + schema_checkpoint     = (known after apply)
      + schema_definition     = jsonencode(
            {
              + "$schema"  = "http://json-schema.org/draft-07/schema#"
              + properties = {
                  + eventData       = {
                      + allOf = [
                          + {
                              + description = "Changing Ab Test Event data."
                              + properties  = {
                                  + abChangeType              = {
                                      + description = "The type of change that has occurred"
                                      + enum        = [
                                          + "STARTED",
                                          + "RESTARTED",
                                          + "DISTRIBUTION_CHANGE",
                                          + "STOPPED",
                                          + "REALLOCATED",
                                        ]
                                      + type        = "string"
                                    }
                                  + latestReallocationVersion = {
                                      + description = "Does the version ."
                                      + type        = "integer"
                                    }
                                  + testGroups                = {
                                      + description = "Current Groups and Weightings for the test"
                                      + items       = {
                                          + properties = {
                                              + name      = {
                                                  + type = "string"
                                                }
                                              + weighting = {
                                                  + type = "string"
                                                }
                                            }
                                          + type       = "object"
                                        }
                                      + type        = "array"
                                    }
                                }
                              + type        = "object"
                            },
                          + {
                              + description = "The event payload."
                            },
                        ]
                    }
                  + eventTime       = {
                      + description = "When the event occurred."
                      + type        = "string"
                    }
                  + metadata        = {
                      + description = "Metadata used by producer library to identify the event."
                      + properties  = {
                          + event_id    = {
                              + description = "unique id for the event."
                              + type        = "string"
                            }
                          + event_type  = {
                              + description = "the type of event."
                              + type        = "string"
                            }
                          + occurred_at = {
                              + description = "The time the event occurred at/was first produced."
                              + type        = "string"
                            }
                          + service     = {
                              + description = "the service provider"
                              + type        = "string"
                            }
                        }
                      + type        = "object"
                    }
                  + participantId   = {
                      + description = "The ID of the quote."
                      + type        = "string"
                    }
                  + resourceVersion = {
                      + description = "The version of the quote after the event has been applied."
                      + type        = "integer"
                    }
                }
              + type       = "object"
            }
        )
      + schema_name           = "AbTestChangeEvent"
      + tags_all              = {
          + "Terraform"      = "true"
          + "product"        = "multi"
          + "product_region" = "uk"
          + "service_name"   = "ab-testing"
          + "team"           = "multi-product"
        }
    }

  # module.event_sourcing.aws_glue_schema.event_glue_schema["AbTestParticipantAllocationEvent"] will be created
  + resource "aws_glue_schema" "event_glue_schema" {
      + arn                   = (known after apply)
      + compatibility         = "BACKWARD"
      + data_format           = "JSON"
      + id                    = (known after apply)
      + latest_schema_version = (known after apply)
      + next_schema_version   = (known after apply)
      + registry_arn          = "arn:aws:glue:eu-west-1:090999133015:registry/automotive"
      + registry_name         = (known after apply)
      + schema_checkpoint     = (known after apply)
      + schema_definition     = jsonencode(
            {
              + "$schema"  = "http://json-schema.org/draft-07/schema#"
              + properties = {
                  + eventData       = {
                      + allOf = [
                          + {
                              + description = "Saving Ab Test Participant Event data."
                              + properties  = {
                                  + testGrouping = {
                                      + type = "string"
                                    }
                                  + testId       = {
                                      + description = "List of deeplinked addons for the quote."
                                      + type        = "string"
                                    }
                                  + testVersion  = {
                                      + type = "integer"
                                    }
                                }
                              + type        = "object"
                            },
                          + {
                              + description = "The event payload."
                            },
                        ]
                    }
                  + eventTime       = {
                      + description = "When the event occurred."
                      + type        = "string"
                    }
                  + metadata        = {
                      + description = "Metadata used by producer library to identify the event."
                      + properties  = {
                          + event_id    = {
                              + description = "unique id for the event."
                              + type        = "string"
                            }
                          + event_type  = {
                              + description = "the type of event."
                              + type        = "string"
                            }
                          + occurred_at = {
                              + description = "The time the event occurred at/was first produced."
                              + type        = "string"
                            }
                          + service     = {
                              + description = "the service provider"
                              + type        = "string"
                            }
                        }
                      + type        = "object"
                    }
                  + participantId   = {
                      + description = "The ID of the quote."
                      + type        = "string"
                    }
                  + resourceVersion = {
                      + description = "The version of the quote after the event has been applied."
                      + type        = "integer"
                    }
                }
              + type       = "object"
            }
        )
      + schema_name           = "AbTestParticipantAllocationEvent"
      + tags_all              = {
          + "Terraform"      = "true"
          + "product"        = "multi"
          + "product_region" = "uk"
          + "service_name"   = "ab-testing"
          + "team"           = "multi-product"
        }
    }

  # module.event_sourcing.null_resource.update_checkpoint["AbTestChangeEvent"] must be replaced
-/+ resource "null_resource" "update_checkpoint" {
      ~ id       = "3154584225030670481" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2023-11-08T17:30:53Z" -> (known after apply)
        }
    }

  # module.event_sourcing.null_resource.update_checkpoint["AbTestParticipantAllocationEvent"] must be replaced
-/+ resource "null_resource" "update_checkpoint" {
      ~ id       = "2479356769762843164" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2023-11-08T17:30:53Z" -> (known after apply)
        }
    }

  # module.ab_testing.module.java_ecs_service.aws_ecs_task_definition.service_task_definition must be replaced
-/+ resource "aws_ecs_task_definition" "service_task_definition" {
      ~ arn                      = "arn:aws:ecs:eu-west-1:090999133015:task-definition/ab-testing:14" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:eu-west-1:090999133015:task-definition/ab-testing" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ environment      = [
                        # (3 unchanged elements hidden)
                        {
                            name  = "DD_TRACE_SAMPLE_RATE"
                            value = "0.5"
                        },
                      ~ {
                            name  = "DD_VERSION"
                          ~ value = "0.0.15-73" -> "0.0.16-78"
                        },
                        {
                            name  = "cloud.aws.credentials.instanceProfile"
                            value = "true"
                        },
                        # (5 unchanged elements hidden)
                    ]
                  ~ image            = "007126583757.dkr.ecr.eu-west-1.amazonaws.com/uk-multi-ab-testing:0.0.15-73" -> "007126583757.dkr.ecr.eu-west-1.amazonaws.com/uk-multi-ab-testing:0.0.16-78"
                  - mountPoints      = []
                    name             = "ab-testing"
                  - volumesFrom      = []
                    # (8 unchanged attributes hidden)
                },
              ~ {
                  - mountPoints  = []
                    name         = "datadog-agent"
                  - volumesFrom  = []
                    # (6 unchanged attributes hidden)
                },
              ~ {
                  - environment           = []
                  - mountPoints           = []
                    name                  = "aws-for-fluent-bit"
                  - portMappings          = []
                  - volumesFrom           = []
                    # (6 unchanged attributes hidden)
                },
              ~ {
                  - mountPoints      = []
                    name             = "envoy"
                  - portMappings     = []
                  - volumesFrom      = []
                    # (9 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "ab-testing" -> (known after apply)
      ~ revision                 = 14 -> (known after apply)
      ~ tags                     = {
            "service" = "ab-testing"
          ~ "version" = "0.0.15-73" -> "0.0.16-78"
        }
      ~ tags_all                 = {
          ~ "version"        = "0.0.15-73" -> "0.0.16-78"
            # (6 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 5 to add, 0 to change, 3 to destroy.

Warning: Argument is deprecated

  with module.event_sourcing.module.table.snowflake_table.this,
  on .terraform/modules/event_sourcing.table/snowflake/modules/table/main.tf line 21, in resource "snowflake_table" "this":
  21:   data_retention_days = 7

Use data_retention_time_in_days attribute instead

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: production.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "production.plan"

```
</details>